piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_timer.h
/**
 *******************************************************************************
 * @file    MDR32F2xQI_timer.h
 * @author  Milandr Application Team
 * @version V1.0.0
 * @date    24/05/2023
 * @brief   This file contains all the functions prototypes for the TIMER
 *          firmware library.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F2xQI_TIMER_H
#define __MDR32F2xQI_TIMER_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32F2xQI_config.h"

/** @addtogroup __MDR32F2xQI_StdPeriph_Driver MDR32F2xQI Standard Peripherial Driver
 * @{
 */

/** @addtogroup TIMER TIMER
 * @{
 */

/** @defgroup TIMER_Exported_Types TIMER Exported Types
 * @{
 */

/**
 * @brief TIMER Counter Event Source
 */
typedef enum {
    TIMER_CNT_EVNT_SRC_TIM_CLK = TIMER_CNTRL_EVENT_SEL_TIM_CLK, /*!< Selects rising edge event TIM_CLK. */
    TIMER_CNT_EVNT_SRC_TIM0    = TIMER_CNTRL_EVENT_SEL_TIM0,    /*!< Selects TIMER0 (CNT == ARR) event. */
    TIMER_CNT_EVNT_SRC_TIM1    = TIMER_CNTRL_EVENT_SEL_TIM1,    /*!< Selects TIMER1 (CNT == ARR) event. */
    TIMER_CNT_EVNT_SRC_CH1     = TIMER_CNTRL_EVENT_SEL_CH1,     /*!< Selects Channel 1 event. */
#if defined(USE_MDR32F21QI)
    TIMER_CNT_EVNT_SRC_CH2 = TIMER_CNTRL_EVENT_SEL_CH2,         /*!< Selects Channel 2 event. */
    TIMER_CNT_EVNT_SRC_CH3 = TIMER_CNTRL_EVENT_SEL_CH3,         /*!< Selects Channel 3 event. */
    TIMER_CNT_EVNT_SRC_CH4 = TIMER_CNTRL_EVENT_SEL_CH4,         /*!< Selects Channel 4 event. */
#endif
    TIMER_CNT_EVNT_SRC_ETR_RE = TIMER_CNTRL_EVENT_SEL_ETR_RE,   /*!< Selects a rising edge event on ETR. */
    TIMER_CNT_EVNT_SRC_ETR_FE = TIMER_CNTRL_EVENT_SEL_ETR_FE    /*!< Selects a falling edge event on ETR. */
} TIMER_CNT_EventSource_TypeDef;

#if defined(USE_MDR32F21QI)
#define IS_TIMER_COUNTER_EVENT_SOURCE(SOURCE) (((SOURCE) == TIMER_CNT_EVNT_SRC_TIM_CLK) || \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_TIM0) ||    \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_TIM1) ||    \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_CH1) ||     \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_CH2) ||     \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_CH3) ||     \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_CH4) ||     \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_ETR_RE) ||  \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_ETR_FE))
#elif defined(USE_MDR32F23QI)
#define IS_TIMER_COUNTER_EVENT_SOURCE(SOURCE) (((SOURCE) == TIMER_CNT_EVNT_SRC_TIM_CLK) || \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_TIM0) ||    \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_TIM1) ||    \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_CH1) ||     \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_ETR_RE) ||  \
                                               ((SOURCE) == TIMER_CNT_EVNT_SRC_ETR_FE))
#endif

/**
 * @brief TIMER Counter Mode
 */
typedef enum {
    TIMER_CNT_MODE_CLK_FIXED_DIR  = TIMER_CNTRL_CNT_MODE_CLK_FIXED_DIR,  /*!< The value of CNT changes on rising edge of TIM_CLK. The direction of the count remains constant. */
    TIMER_CNT_MODE_CLK_CHANGE_DIR = TIMER_CNTRL_CNT_MODE_CLK_CHANGE_DIR, /*!< The value of CNT changes on rising edge of TIM_CLK. The direction of the count changes. */
    TIMER_CNT_MODE_EVNT_FIXED_DIR = TIMER_CNTRL_CNT_MODE_EVNT_FIXED_DIR  /*!< The value of CNT changes on the specified event. The direction of the count remains constant. */
} TIMER_CNT_Mode_TypeDef;

#define IS_TIMER_COUNTER_MODE(MODE) (((MODE) == TIMER_CNT_MODE_CLK_FIXED_DIR) ||  \
                                     ((MODE) == TIMER_CNT_MODE_CLK_CHANGE_DIR) || \
                                     ((MODE) == TIMER_CNT_MODE_EVNT_FIXED_DIR))

/**
 * @brief TIMER Counter Direction
 */
typedef enum {
    TIMER_CNT_DIR_UP   = (((uint32_t)0x0) << TIMER_CNTRL_DIR_Pos), /*!< Increments the timer CNT counter value. */
    TIMER_CNT_DIR_DOWN = (((uint32_t)0x1) << TIMER_CNTRL_DIR_Pos)  /*!< Decrements the timer CNT counter value. */
} TIMER_CNT_Dir_TypeDef;

#define IS_TIMER_COUNTER_DIR(DIR) (((DIR) == TIMER_CNT_DIR_UP) || \
                                   ((DIR) == TIMER_CNT_DIR_DOWN))

/**
 * @brief TIMER FDTS Prescaler
 */
typedef enum {
    TIMER_FDTS_PRESCALER_DIV_1 = TIMER_CNTRL_FDTS_DIV_1, /*!< The FDTS data sampling rate is every TIM_CLK. */
    TIMER_FDTS_PRESCALER_DIV_2 = TIMER_CNTRL_FDTS_DIV_2, /*!< The FDTS data sampling rate is every 2nd TIM_CLK. */
    TIMER_FDTS_PRESCALER_DIV_3 = TIMER_CNTRL_FDTS_DIV_3, /*!< The FDTS data sampling rate is every 3rd TIM_CLK. */
    TIMER_FDTS_PRESCALER_DIV_4 = TIMER_CNTRL_FDTS_DIV_4  /*!< The FDTS data sampling rate is every 4th TIM_CLK. */
} TIMER_FDTS_Prescaler_TypeDef;

#define IS_TIMER_FDTS_PRESCALER(VALUE) (((VALUE) == TIMER_FDTS_PRESCALER_DIV_1) || \
                                        ((VALUE) == TIMER_FDTS_PRESCALER_DIV_2) || \
                                        ((VALUE) == TIMER_FDTS_PRESCALER_DIV_3) || \
                                        ((VALUE) == TIMER_FDTS_PRESCALER_DIV_4))

/**
 * @brief TIMER ARR Update Mode
 */
typedef enum {
    TIMER_ARR_UPD_IMMEDIATELY   = (((uint32_t)0x0) << TIMER_CNTRL_ARRB_EN_Pos), /*!< The ARR register is updated immediately. */
    TIMER_ARR_UPD_ON_CNT_EQ_ARR = (((uint32_t)0x1) << TIMER_CNTRL_ARRB_EN_Pos)  /*!< The ARR register is updated at (CNT == ARR) condition. */
} TIMER_ARR_UpdateMode_TypeDef;

