piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_timer.h
#if defined(USE_MDR32F21QI)
#define IS_TIMER_CHANNEL_NUMBER(NUMBER) (((NUMBER) == TIMER_CH1) || \
                                         ((NUMBER) == TIMER_CH2) || \
                                         ((NUMBER) == TIMER_CH3) || \
                                         ((NUMBER) == TIMER_CH4))
#elif defined(USE_MDR32F23QI)
#define IS_TIMER_CHANNEL_NUMBER(NUMBER) ((NUMBER) == TIMER_CH1)
#endif

/**
 * @brief TIMER Channel Mode
 */
typedef enum {
    TIMER_CH_MODE_PWM     = (((uint32_t)0x0) << TIMER_CH_CNTRL_CAP_nPWM_Pos), /*!< Specifies the PWM channel mode. */
    TIMER_CH_MODE_CAPTURE = (((uint32_t)0x1) << TIMER_CH_CNTRL_CAP_nPWM_Pos)  /*!< Specifies the Capture channel mode. */
} TIMER_CH_Mode_TypeDef;

#define IS_TIMER_CHANNEL_MODE(MODE) (((MODE) == TIMER_CH_MODE_PWM) || \
                                     ((MODE) == TIMER_CH_MODE_CAPTURE))

/**
 * @brief TIMER Channel REF Format in PWM mode
 */
typedef enum {
    TIMER_CH_PWM_REF_FORMAT_0 = TIMER_CH_CNTRL_OCCM_FORMAT_0, /*!< REF = 0. */
    TIMER_CH_PWM_REF_FORMAT_1 = TIMER_CH_CNTRL_OCCM_FORMAT_1, /*!< REF = 1 if: (CNT == CCR) or ((CNT == CCR1) and CCR1_EN = 1),
                                                                   else REF = 0. */
    TIMER_CH_PWM_REF_FORMAT_2 = TIMER_CH_CNTRL_OCCM_FORMAT_2, /*!< REF = 0 if: (CNT == CCR) or ((CNT == CCR1) and CCR1_EN = 1),
                                                                   else REF = 1. */
    TIMER_CH_PWM_REF_FORMAT_3 = TIMER_CH_CNTRL_OCCM_FORMAT_3, /*!< Toggle REF state if: (CNT == CCR) or
                                                                                       ((CNT == CCR1) and CCR1_EN = 1). */
    TIMER_CH_PWM_REF_FORMAT_4 = TIMER_CH_CNTRL_OCCM_FORMAT_4, /*!< REF = 0. */
    TIMER_CH_PWM_REF_FORMAT_5 = TIMER_CH_CNTRL_OCCM_FORMAT_5, /*!< REF = 1. */
    TIMER_CH_PWM_REF_FORMAT_6 = TIMER_CH_CNTRL_OCCM_FORMAT_6, /*!< If CCR1_EN = 0:
                                                                     DIR = 0: REF = 1 if (CNT < CCR), else REF = 0,
                                                                     DIR = 1: REF = 0 if (CNT > CCR), else REF = 1,
                                                                   else if CCR1_EN = 1:
                                                                     DIR = 0: REF = 0 if (CCR ≤ CNT ≤ CCR1), else REF = 1,
                                                                     DIR = 1: REF = 0 if (CCR < CNT < CCR1), else REF = 1.
                                                                   The condition (CCR < CCR1) must be observed. */
    TIMER_CH_PWM_REF_FORMAT_7 = TIMER_CH_CNTRL_OCCM_FORMAT_7  /*!< If CCR1_EN = 0:
                                                                      DIR = 0: REF = 0 if (CNT < CCR), else REF = 1,
                                                                      DIR = 1: REF = 1 if (CNT > CCR), else REF = 0,
                                                                   else if CCR1_EN = 1:
                                                                      DIR = 0: REF = 1 if (CCR ≤ CNT ≤ CCR1), else REF = 0,
                                                                      DIR = 1: REF = 1 if (CCR < CNT < CCR1), else REF = 0.
                                                                   The condition (CCR < CCR1) must be observed. */
} TIMER_CH_PWM_REF_Format_TypeDef;

#define IS_TIMER_CHANNEL_PWM_REF_FORMAT(FORMAT) (((FORMAT) == TIMER_CH_PWM_REF_FORMAT_0) || \
                                                 ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_1) || \
                                                 ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_2) || \
                                                 ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_3) || \
                                                 ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_4) || \
                                                 ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_5) || \
                                                 ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_6) || \
                                                 ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_7))

/**
 * @brief TIMER CCR and CCR1 Update mode in PWM mode
 */
typedef enum {
    TIMER_CH_PWM_CCR_UPD_IMMEDIATELY = (((uint32_t)0x0) << TIMER_CH_CNTRL2_CCRRLD_Pos), /*!< The CCR and CCR1 registers is updated immediately. */
    TIMER_CH_PWM_CCR_UPD_ON_CNT_EQ_0 = (((uint32_t)0x1) << TIMER_CH_CNTRL2_CCRRLD_Pos)  /*!< The CCR and CCR1 registers is updated at (CNT == 0) condition. */
} TIMER_CH_PWM_CCR_UpdateMode_TypeDef;

#define IS_TIMER_CHANNEL_PWM_CCR_UPDATE_MODE(MODE) (((MODE) == TIMER_CH_PWM_CCR_UPD_IMMEDIATELY) || \
                                                    ((MODE) == TIMER_CH_PWM_CCR_UPD_ON_CNT_EQ_0))

/**
 * @brief TIMER Channel Events Prescaler in capture mode
 */
typedef enum {
    TIMER_CH_CAP_EVNT_PRESCALER_DIV_1 = TIMER_CH_CNTRL_CHPSC_DIV_1, /*!< Each event is captured. */
    TIMER_CH_CAP_EVNT_PRESCALER_DIV_2 = TIMER_CH_CNTRL_CHPSC_DIV_2, /*!< Capturing every 2nd event */
    TIMER_CH_CAP_EVNT_PRESCALER_DIV_4 = TIMER_CH_CNTRL_CHPSC_DIV_4, /*!< Capturing every 4th event */
    TIMER_CH_CAP_EVNT_PRESCALER_DIV_8 = TIMER_CH_CNTRL_CHPSC_DIV_8  /*!< Capturing every 8th event */
} TIMER_CH_CAP_EventPrescaler_TypeDef;

#define IS_TIMER_CHANNEL_CAP_EVENT_PRESCALER(VALUE) (((VALUE) == TIMER_CH_CAP_EVNT_PRESCALER_DIV_1) || \
                                                     ((VALUE) == TIMER_CH_CAP_EVNT_PRESCALER_DIV_2) || \
                                                     ((VALUE) == TIMER_CH_CAP_EVNT_PRESCALER_DIV_4) || \
                                                     ((VALUE) == TIMER_CH_CAP_EVNT_PRESCALER_DIV_8))

/**
 * @brief TIMER Channel CCR Event Source in capture mode
 */
typedef enum {
    TIMER_CH_CAP_CCR_EVNT_SRC_RE = TIMER_CH_CNTRL_CHSEL_CH_RE,        /*!< Selects rising edge from current TIMER channel. */
    TIMER_CH_CAP_CCR_EVNT_SRC_FE = TIMER_CH_CNTRL_CHSEL_CH_FE,        /*!< Selects falling edge from current TIMER channel. */
#if defined(USE_MDR32F21QI)
    TIMER_CH_CAP_CCR_EVNT_SRC_RE_CHp1 = TIMER_CH_CNTRL_CHSEL_CHp1_RE, /*!< Selects rising edge from other TIMER channel (current channel plus 1). */
    TIMER_CH_CAP_CCR_EVNT_SRC_RE_CHp2 = TIMER_CH_CNTRL_CHSEL_CHp2_RE  /*!< Selects rising edge from other TIMER channel (current channel plus 2). */
#endif
} TIMER_CH_CAP_CCR_EventSource_TypeDef;

