piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/inc/MDR32F2xQI_timer.h
#define IS_TIMER_CHANNEL_OUTP_MODE(MODE) (((MODE) == TIMER_CH_OUTP_MODE_IN) ||        \
                                          ((MODE) == TIMER_CH_OUTP_MODE_OUT) ||       \
                                          ((MODE) == TIMER_CH_OUTP_MODE_REF_AS_OE) || \
                                          ((MODE) == TIMER_CH_OUTP_MODE_DTG_AS_OE))

/**
 * @brief TIMER Channel Negative Output Polarity
 */
typedef enum {
    TIMER_CH_OUTN_POLARITY_NON_INV = (((uint32_t)0x0) << TIMER_CH_CNTRL1_NINV_Pos), /*!< The channel negative output is not inverted. */
    TIMER_CH_OUTN_POLARITY_INV     = (((uint32_t)0x1) << TIMER_CH_CNTRL1_NINV_Pos)  /*!< The channel negative output is inverted. */
} TIMER_CH_OUTN_Polarity_TypeDef;

#define IS_TIMER_CHANNEL_OUTN_POLARITY(STATE) (((STATE) == TIMER_CH_OUTN_POLARITY_NON_INV) || \
                                               ((STATE) == TIMER_CH_OUTN_POLARITY_INV))

/**
 * @brief TIMER Channel Negative Output Source
 */
typedef enum {
    TIMER_CH_OUTN_SRC_0   = TIMER_CH_CNTRL1_NSELO_ALW0, /*!< Selects the '0' state on the nCHy line. */
    TIMER_CH_OUTN_SRC_1   = TIMER_CH_CNTRL1_NSELO_ALW1, /*!< Selects the '1' state on the nCHy line. */
    TIMER_CH_OUTN_SRC_REF = TIMER_CH_CNTRL1_NSELO_REF,  /*!< Selects the nREF state on the nCHy line. */
    TIMER_CH_OUTN_SRC_DTG = TIMER_CH_CNTRL1_NSELO_DTG   /*!< Selects the DTG output state on the nCHy line. */
} TIMER_CH_OUTN_Source_TypeDef;

#define IS_TIMER_CHANNEL_OUTN_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_OUTN_SRC_0) ||   \
                                              ((SOURCE) == TIMER_CH_OUTN_SRC_1) ||   \
                                              ((SOURCE) == TIMER_CH_OUTN_SRC_REF) || \
                                              ((SOURCE) == TIMER_CH_OUTN_SRC_DTG))

/**
 * @brief TIMER Channel Negative Output Mode
 */
typedef enum {
    TIMER_CH_OUTN_MODE_IN        = TIMER_CH_CNTRL1_NSELOE_ALW0, /*!< Selects the Input mode on the nCHy line. */
    TIMER_CH_OUTN_MODE_OUT       = TIMER_CH_CNTRL1_NSELOE_ALW1, /*!< Selects the Output mode on the nCHy line. */
    TIMER_CH_OUTN_MODE_REF_AS_OE = TIMER_CH_CNTRL1_NSELOE_REF,  /*!< The nREF signal specifies the nCHy line mode. */
    TIMER_CH_OUTN_MODE_DTG_AS_OE = TIMER_CH_CNTRL1_NSELOE_DTG   /*!< The DTG output specifies the nCHy line mode. */
} TIMER_CH_OUTN_Mode_TypeDef;

#define IS_TIMER_CHANNEL_OUTN_MODE(MODE) (((MODE) == TIMER_CH_OUTN_MODE_IN) ||        \
                                          ((MODE) == TIMER_CH_OUTN_MODE_OUT) ||       \
                                          ((MODE) == TIMER_CH_OUTN_MODE_REF_AS_OE) || \
                                          ((MODE) == TIMER_CH_OUTN_MODE_DTG_AS_OE))

/**
 * @brief TIMER Channel DTG Clock Source
 */
typedef enum {
    TIMER_CH_DTG_CLK_SRC_TIM_CLK = (((uint32_t)0x0) << TIMER_CH_DTG_EDTS_Pos), /*!< Specifies the TIM_CLK signal as DTG clock source. */
    TIMER_CH_DTG_CLK_SRC_FDTS    = (((uint32_t)0x1) << TIMER_CH_DTG_EDTS_Pos)  /*!< Specifies the FDTS signal as DTG clock source. */
} TIMER_CH_DTG_ClockSource_TypeDef;

#define IS_TIMER_CHANNEL_DTG_CLK_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_DTG_CLK_SRC_TIM_CLK) || \
                                                 ((SOURCE) == TIMER_CH_DTG_CLK_SRC_FDTS))

/**
 * @brief TIMER Flags
 */
typedef enum {
    TIMER_FLAG_CNT_ZERO     = TIMER_STATUS_CNT_ZERO_EVENT,     /*!< The (CNT == 0) condition occurred. */
    TIMER_FLAG_CNT_ARR      = TIMER_STATUS_CNT_ARR_EVENT,      /*!< The (CNT == ARR) condition occurred. */
    TIMER_FLAG_ETR_RE       = TIMER_STATUS_ETR_RE_EVENT,       /*!< The ETR rising edge occurred. */
    TIMER_FLAG_ETR_FE       = TIMER_STATUS_ETR_FE_EVENT,       /*!< The ETR falling edge occurred. */
    TIMER_FLAG_BRK          = TIMER_STATUS_BRK_EVENT,          /*!< The (BRK == 1) condition occurred. */
    TIMER_FLAG_CH1_CAP_CCR  = TIMER_STATUS_CCR_CAP_EVENT_CH1,  /*!< The Channel 1 CCR capture condition occurred. */
    TIMER_FLAG_CH1_PWM_REF  = TIMER_STATUS_CCR_REF_EVENT_CH1,  /*!< The Channel 1 (REF == 1) condition occurred. */
    TIMER_FLAG_CH1_CAP_CCR1 = TIMER_STATUS_CCR_CAP1_EVENT_CH1, /*!< The Channel 1 CCR1 capture condition occurred. */
#if defined(USE_MDR32F21QI)
    TIMER_FLAG_CH2_CAP_CCR  = TIMER_STATUS_CCR_CAP_EVENT_CH2,  /*!< The Channel 2 CCR capture condition occurred. */
    TIMER_FLAG_CH3_CAP_CCR  = TIMER_STATUS_CCR_CAP_EVENT_CH3,  /*!< The Channel 3 CCR capture condition occurred. */
    TIMER_FLAG_CH4_CAP_CCR  = TIMER_STATUS_CCR_CAP_EVENT_CH4,  /*!< The Channel 4 CCR capture condition occurred. */
    TIMER_FLAG_CH2_PWM_REF  = TIMER_STATUS_CCR_REF_EVENT_CH2,  /*!< The Channel 2 (REF == 1) condition occurred. */
    TIMER_FLAG_CH3_PWM_REF  = TIMER_STATUS_CCR_REF_EVENT_CH3,  /*!< The Channel 3 (REF == 1) condition occurred. */
    TIMER_FLAG_CH4_PWM_REF  = TIMER_STATUS_CCR_REF_EVENT_CH4,  /*!< The Channel 4 (REF == 1) condition occurred. */
    TIMER_FLAG_CH2_CAP_CCR1 = TIMER_STATUS_CCR_CAP1_EVENT_CH2, /*!< The Channel 2 CCR1 capture condition occurred. */
    TIMER_FLAG_CH3_CAP_CCR1 = TIMER_STATUS_CCR_CAP1_EVENT_CH3, /*!< The Channel 3 CCR1 capture condition occurred. */
    TIMER_FLAG_CH4_CAP_CCR1 = TIMER_STATUS_CCR_CAP1_EVENT_CH4  /*!< The Channel 4 CCR1 capture condition occurred. */
#endif
} TIMER_Flags_TypeDef;

#if defined(USE_MDR32F21QI)
#define TIMER_FLAG_MASK (TIMER_FLAG_CNT_ZERO |     \
                         TIMER_FLAG_CNT_ARR |      \
                         TIMER_FLAG_ETR_RE |       \
                         TIMER_FLAG_ETR_FE |       \
                         TIMER_FLAG_BRK |          \
                         TIMER_FLAG_CH1_CAP_CCR |  \
                         TIMER_FLAG_CH2_CAP_CCR |  \
                         TIMER_FLAG_CH3_CAP_CCR |  \
                         TIMER_FLAG_CH4_CAP_CCR |  \
                         TIMER_FLAG_CH1_PWM_REF |  \
                         TIMER_FLAG_CH2_PWM_REF |  \
                         TIMER_FLAG_CH3_PWM_REF |  \
                         TIMER_FLAG_CH4_PWM_REF |  \
                         TIMER_FLAG_CH1_CAP_CCR1 | \
                         TIMER_FLAG_CH2_CAP_CCR1 | \
                         TIMER_FLAG_CH3_CAP_CCR1 | \
                         TIMER_FLAG_CH4_CAP_CCR1)

#define IS_TIMER_FLAG(FLAG) (((FLAG) == TIMER_FLAG_CNT_ZERO) ||     \
                             ((FLAG) == TIMER_FLAG_CNT_ARR) ||      \
                             ((FLAG) == TIMER_FLAG_ETR_RE) ||       \
                             ((FLAG) == TIMER_FLAG_ETR_FE) ||       \
                             ((FLAG) == TIMER_FLAG_BRK) ||          \
                             ((FLAG) == TIMER_FLAG_CH1_CAP_CCR) ||  \
                             ((FLAG) == TIMER_FLAG_CH2_CAP_CCR) ||  \
                             ((FLAG) == TIMER_FLAG_CH3_CAP_CCR) ||  \
                             ((FLAG) == TIMER_FLAG_CH4_CAP_CCR) ||  \
                             ((FLAG) == TIMER_FLAG_CH1_PWM_REF) ||  \
                             ((FLAG) == TIMER_FLAG_CH2_PWM_REF) ||  \
                             ((FLAG) == TIMER_FLAG_CH3_PWM_REF) ||  \
                             ((FLAG) == TIMER_FLAG_CH4_PWM_REF) ||  \
                             ((FLAG) == TIMER_FLAG_CH1_CAP_CCR1) || \
                             ((FLAG) == TIMER_FLAG_CH2_CAP_CCR1) || \
                             ((FLAG) == TIMER_FLAG_CH3_CAP_CCR1) || \
                             ((FLAG) == TIMER_FLAG_CH4_CAP_CCR1))
#elif defined(USE_MDR32F23QI)
#define TIMER_FLAG_MASK (TIMER_FLAG_CNT_ZERO |    \
                         TIMER_FLAG_CNT_ARR |     \
                         TIMER_FLAG_ETR_RE |      \
                         TIMER_FLAG_ETR_FE |      \
                         TIMER_FLAG_BRK |         \
                         TIMER_FLAG_CH1_CAP_CCR | \
                         TIMER_FLAG_CH1_PWM_REF | \
                         TIMER_FLAG_CH1_CAP_CCR1)

#define IS_TIMER_FLAG(FLAG) (((FLAG) == TIMER_FLAG_CNT_ZERO) ||    \
                             ((FLAG) == TIMER_FLAG_CNT_ARR) ||     \
                             ((FLAG) == TIMER_FLAG_ETR_RE) ||      \
                             ((FLAG) == TIMER_FLAG_ETR_FE) ||      \
                             ((FLAG) == TIMER_FLAG_BRK) ||         \
                             ((FLAG) == TIMER_FLAG_CH1_CAP_CCR) || \
                             ((FLAG) == TIMER_FLAG_CH1_PWM_REF) || \
                             ((FLAG) == TIMER_FLAG_CH1_CAP_CCR1))
#endif
#define IS_TIMER_FLAGS(FLAGS) (((FLAGS) & ~((uint32_t)TIMER_FLAG_MASK)) == 0)

/**
 * @brief TIMER Counter Init structure definition
 */
typedef struct
{
    uint16_t TIMER_CounterValue;                            /*!< Specifies the initial counter value.
                                                                 This parameter can be a number between 0x0000 and 0xFFFF. */
    uint16_t TIMER_CounterPrescaler;                        /*!< Specifies the prescaler value used to divide the TIM_CLK.
                                                                 This parameter can be a number between 0x0000 and 0xFFFF.
                                                                 CLK = TIM_CLK/(TIMER_CounterPrescaler + 1) */
    uint16_t TIMER_CounterPeriod;                           /*!< Specifies the value to be loaded into the Auto-Reload Register (ARR)
                                                                 at the next update event (full period = ARR (TIMER_CounterPeriod) + 1).
                                                                 This parameter must be a number between 0x0000 and 0xFFFF.  */
    TIMER_CNT_EventSource_TypeDef TIMER_CounterEventSource; /*!< Specifies the Counter Event source.
                                                                 This parameter can be a value of @ref TIMER_CNT_EventSource_TypeDef */
    TIMER_CNT_Mode_TypeDef TIMER_CounterMode;               /*!< Specifies the counter mode.
                                                                 This parameter can be a value of @ref TIMER_CNT_Mode_TypeDef
                                                                 Note: TIMER_CounterMode use with TIMER_CounterEventSource!
                                                                       If TIMER_CounterEventSource != TIMER_EVNT_SRC_TIM_CLK, then TIMER_CounterMode = TIMER_CNT_MODE_EVNT_FIXED_DIR */
    TIMER_CNT_Dir_TypeDef TIMER_CounterDirection;           /*!< Specifies the counter direction.
                                                                 This parameter can be a value of @ref TIMER_CNT_Dir_TypeDef */
    TIMER_FDTS_Prescaler_TypeDef TIMER_FDTS_Prescaler;      /*!< Specifies the FDTS Prescaler configuration.
                                                                 This parameter can be a value of @ref TIMER_FDTS_Prescaler_TypeDef */
    TIMER_ARR_UpdateMode_TypeDef TIMER_ARR_UpdateMode;      /*!< Specifies the Auto-Reload Register (ARR) updating mode.
                                                                 This parameter can be a value of @ref TIMER_ARR_UpdateMode_TypeDef */
    TIMER_ETR_Filter_TypeDef TIMER_ETR_Filter;              /*!< Specifies the ETR Filter configuration.
                                                                 This parameter can be a value of @ref TIMER_ETR_Filter_TypeDef */
    TIMER_ETR_Prescaler_TypeDef TIMER_ETR_Prescaler;        /*!< Specifies the ETR Prescaler configuration.
                                                                 This parameter can be a value of @ref TIMER_ETR_Prescaler_TypeDef */
    TIMER_ETR_Polarity_TypeDef TIMER_ETR_Polarity;          /*!< Specifies the ETR Polarity configuration.
                                                                 This parameter can be a value of @ref TIMER_ETR_Polarity_TypeDef */
    TIMER_BRK_Polarity_TypeDef TIMER_BRK_Polarity;          /*!< Specifies the BRK Polarity configuration.
                                                                 This parameter can be a value of @ref TIMER_BRK_Polarity_TypeDef */
} TIMER_CNT_InitTypeDef;

/**
 * @brief TIMER Channel Init structure definition
 */
typedef struct
{
    TIMER_CH_Number_TypeDef TIMER_CH_Number;                             /*!< Specifies the TIMER Channel number to be configured.
                                                                              This parameter can be a value of @ref TIMER_CH_Number_TypeDef */
    TIMER_CH_Mode_TypeDef TIMER_CH_Mode;                                 /*!< Specifies the TIMER Channel mode.
                                                                              This parameter can be a value of @ref TIMER_CH_Mode_TypeDef */
    FunctionalState TIMER_CH_CCR1_Cmd;                                   /*!< Enables or disables the CCR1 register.
                                                                              This parameter can be a value of @ref FunctionalState */
    TIMER_CH_PWM_REF_Format_TypeDef TIMER_CH_PWM_REF_Format;             /*!< Specifies the REF signal format in PWM mode.
                                                                              This parameter can be a value of @ref TIMER_CH_PWM_REF_Format_TypeDef */
    TIMER_CH_PWM_CCR_UpdateMode_TypeDef TIMER_CH_PWM_CCR_UpdateMode;     /*!< Specifies the TIMER CCR, CCR1 update mode in PWM mode.
                                                                              This parameter can be a value of @ref TIMER_CH_PWM_CCR_UpdateMode_TypeDef */
    FunctionalState TIMER_CH_PWM_ETR_Reset;                              /*!< Enables or disables REF reset by ETR (active high) in PWM mode.
                                                                              This parameter can be a value of @ref FunctionalState */
    FunctionalState TIMER_CH_PWM_BRK_Reset;                              /*!< Enables or disables REF and DTG reset by BRK (active low) in PWM mode.
                                                                              This parameter can be a value of @ref FunctionalState */
    TIMER_CH_CAP_CCR_EventSource_TypeDef TIMER_CH_CAP_CCR_EventSource;   /*!< Specifies the Channel CCR Event source in capture mode.
                                                                              This parameter can be a value of @ref TIMER_CH_CAP_CCR_EventSource_TypeDef */
    TIMER_CH_CAP_CCR1_EventSource_TypeDef TIMER_CH_CAP_CCR1_EventSource; /*!< Specifies the Channel CCR1 Event source in capture mode.
                                                                              This parameter can be a value of @ref TIMER_CH_CAP_CCR1_EventSource_TypeDef */
    TIMER_CH_CAP_EventPrescaler_TypeDef TIMER_CH_CAP_EventPrescaler;     /*!< Specifies the TIMER Channel Events Prescaler configuration in capture mode.
                                                                              This parameter can be a value of @ref TIMER_CH_CAP_EventPrescaler_TypeDef */
#if defined(USE_MDR32F23QI)
    FunctionalState TIMER_CH_CAP_EventDelay;                             /*!< Enables or disables synchronization between the capture event and the update of registers CCR and CCR1.
                                                                              This parameter can be a value of @ref FunctionalState */
#endif
    TIMER_CH_Filter_TypeDef TIMER_CH_Filter;                             /*!< Specifies the TIMER Channel Filter configuration.
                                                                              This parameter can be a value of @ref TIMER_CH_Filter_TypeDef */
} TIMER_CH_InitTypeDef;

/**
 * @brief TIMER Channel Output Init structure definition
 */
typedef struct
{
    TIMER_CH_Number_TypeDef TIMER_CH_Number;                   /*!< Specifies the TIMER Channel number to be configured.
                                                                    This parameter can be a value of @ref TIMER_CH_Number_TypeDef */
    TIMER_CH_OUTP_Polarity_TypeDef TIMER_CH_OUTP_Polarity;     /*!< Specifies the TIMER CHy output polarity.
                                                                    This parameter can be a value of @ref TIMER_CH_OUTP_Polarity_TypeDef */
    TIMER_CH_OUTP_Source_TypeDef TIMER_CH_OUTP_Source;         /*!< Specifies the TIMER CHy output source.
                                                                    This parameter can be a value of @ref TIMER_CH_OUTP_Source_TypeDef */
    TIMER_CH_OUTP_Mode_TypeDef TIMER_CH_OUTP_Mode;             /*!< Specifies the TIMER CHy output enable source.
                                                                    This parameter can be a value of @ref TIMER_CH_OUTP_Mode_TypeDef */
    TIMER_CH_OUTN_Polarity_TypeDef TIMER_CH_OUTN_Polarity;     /*!< Enables or disables the TIMER nCHy output inversion.
                                                                    This parameter can be a value of @ref TIMER_CH_OUTN_Polarity_TypeDef */
    TIMER_CH_OUTN_Source_TypeDef TIMER_CH_OUTN_Source;         /*!< Specifies the TIMER nCHy output source.
                                                                    This parameter can be a value of @ref TIMER_CH_OUTN_Source_TypeDef */
    TIMER_CH_OUTN_Mode_TypeDef TIMER_CH_OUTN_Mode;             /*!< Specifies the TIMER nCHy output enable source.
                                                                    This parameter can be a value of @ref TIMER_CH_OUTN_Mode_TypeDef */
    TIMER_CH_DTG_ClockSource_TypeDef TIMER_CH_DTG_ClockSource; /*!< Specifies the TIMER DTG clock source.
                                                                    This parameter can be a value of @ref TIMER_CH_DTG_ClockSource_TypeDef */
    uint8_t TIMER_CH_DTG_MainPrescaler;                        /*!< Specifies the main prescaler of TIMER DTG.
                                                                    This parameter can be a number between 0x00 and 0xFF.
                                                                    Delay DTGdel = TIMER_CH_DTG_MainPrescaler*(TIMER_CH_DTG_AuxPrescaler + 1) clocks. */
    uint8_t TIMER_CH_DTG_AuxPrescaler;                         /*!< Specifies the auxiliary prescaler of TIMER DTG.
                                                                    This parameter can be a number between 0x00 and 0x0F.
                                                                    Delay DTGdel = TIMER_CH_DTG_MainPrescaler*(TIMER_CH_DTG_AuxPrescaler + 1) clocks. */
} TIMER_CH_OUT_InitTypeDef;

/** @} */ /* End of group TIMER_Exported_Types */

